import requests

city = {"北海道":"016010", "青森県":"020010", "岩手県":"030010", "宮城県":"040010", "秋田県":"050010", "山形県":"060010", "福島県":"070010", "茨城県":"080010", "栃木県":"090010", "群馬県":"100010", "埼玉県":"110010", "千葉県":"120010", "東京都":"130010", "神奈川県":"140010", "新潟県":"150010", "富山県":"160010", "石川県":"170010", "福井県":"180010", "山梨県":"190010", "長野県":"200010", "岐阜県":"210010", "静岡県":"220010", "愛知県":"230010", "三重県":"240010", "滋賀県":"250010", "京都府":"260010", "大阪府":"270000", "兵庫県":"280010", "奈良県":"290010", "和歌山県":"300010", "鳥取県":"310010", "島根県":"320010", "岡山県":"330010", "広島県":"340010", "山口県":"350010", "徳島県":"360010", "香川県":"370000", "愛媛県":"380010", "高知県":"390010", "福岡県":"400010", "佐賀県":"410010", "長崎県":"420010", "熊本県":"430010", "大分県":"440010", "宮崎県":"450010", "鹿児島県":"460010", "沖縄県":"471010"}

def weather_check(name): #nameに都道府県名を入れるとjsonファイルを返します。県などがついた状態で入れてください。
    code = city[name]
    url = "https://weather.tsukumijima.net/api/forecast/city/" + code
    r = requests.get(url)
    text = r.json()
    weather = text["forecasts"][0]["telop"]
    return weather
#https://docs.google.com/presentation/d/1vaHj18LX2AXSe3E1ZkPz5WhjM295sHoXBrKXgDEDd6k/edit?usp=sharing
print(weather_check(input("県名 = ")))
